avr-rust/avrd/packs/xmegad/ATxmega256D3.atdf
      <value-group caption="Master Command" name="TWI_MASTER_CMD">
        <value caption="No Action" name="NOACT" value="0x00"/>
        <value caption="Issue Repeated Start Condition" name="REPSTART" value="0x01"/>
        <value caption="Receive or Transmit Data" name="RECVTRANS" value="0x02"/>
        <value caption="Issue Stop Condition" name="STOP" value="0x03"/>
      </value-group>
      <value-group caption="Master Bus State" name="TWI_MASTER_BUSSTATE">
        <value caption="Unknown Bus State" name="UNKNOWN" value="0x00"/>
        <value caption="Bus is Idle" name="IDLE" value="0x01"/>
        <value caption="This Module Controls The Bus" name="OWNER" value="0x02"/>
        <value caption="The Bus is Busy" name="BUSY" value="0x03"/>
      </value-group>
      <value-group caption="Slave Interrupt Level" name="TWI_SLAVE_INTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Slave Command" name="TWI_SLAVE_CMD">
        <value caption="No Action" name="NOACT" value="0x00"/>
        <value caption="Used To Complete a Transaction" name="COMPTRANS" value="0x02"/>
        <value caption="Used in Response to Address/Data Interrupt" name="RESPONSE" value="0x03"/>
      </value-group>
      <value-group caption="SDA hold time" name="SDA_HOLD_TIME">
        <value caption="SDA hold time off" value="0x00" name="OFF"/>
        <value caption="Typical 50ns hold time" value="0x01" name="50NS"/>
        <value caption="Typical 300ns hold time" value="0x2" name="300NS"/>
        <value caption="Typical 400ns hold time" value="0x03" name="400NS"/>
      </value-group>
      <interrupt-group name="TWI">
        <interrupt index="0" name="TWIS" caption="TWI Slave Interrupt"/>
        <interrupt index="1" name="TWIM" caption="TWI Master Interrupt"/>
      </interrupt-group>
    </module>
    <module name="PORT" id="I6075" caption="Port Configuration" version="XMEGAD">
      <register-group caption="I/O port Configuration" name="PORTCFG" size="5">
        <register caption="Multi-pin Configuration Mask" name="MPCMASK" offset="0x00" size="1"/>
        <register caption="Virtual Port Control Register A" name="VPCTRLA" offset="0x02" size="1">
          <bitfield caption="Virtual Port 1 Mapping" mask="0xF0" name="VP1MAP" values="PORTCFG_VP1MAP"/>
          <bitfield caption="Virtual Port 0 Mapping" mask="0x0F" name="VP0MAP" values="PORTCFG_VP0MAP"/>
        </register>
        <register caption="Virtual Port Control Register B" name="VPCTRLB" offset="0x03" size="1">
          <bitfield caption="Virtual Port 3 Mapping" mask="0xF0" name="VP3MAP" values="PORTCFG_VP3MAP"/>
          <bitfield caption="Virtual Port 2 Mapping" mask="0x0F" name="VP2MAP" values="PORTCFG_VP2MAP"/>
        </register>
        <register caption="Clock and Event Out Register" name="CLKEVOUT" offset="0x04" size="1">
          <bitfield caption="Clock Output Port" mask="0x03" name="CLKOUT" values="PORTCFG_CLKOUT"/>
          <bitfield caption="Event Output Port" mask="0x30" name="EVOUT" values="PORTCFG_EVOUT"/>
        </register>
      </register-group>
      <register-group caption="Virtual Port" name="VPORT" size="4">
        <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
        <register caption="I/O Port Output" name="OUT" offset="0x01" size="1"/>
        <register caption="I/O Port Input" name="IN" offset="0x02" size="1"/>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x03" size="1">
          <bitfield caption="Port Interrupt 1 Flag" mask="0x02" name="INT1IF"/>
          <bitfield caption="Port Interrupt 0 Flag" mask="0x01" name="INT0IF"/>
        </register>
      </register-group>
      <register-group caption="I/O Ports" name="PORT" size="24">
        <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
        <register caption="I/O Port Data Direction Set" name="DIRSET" offset="0x01" size="1"/>
        <register caption="I/O Port Data Direction Clear" name="DIRCLR" offset="0x02" size="1"/>
        <register caption="I/O Port Data Direction Toggle" name="DIRTGL" offset="0x03" size="1"/>
        <register caption="I/O Port Output" name="OUT" offset="0x04" size="1"/>
        <register caption="I/O Port Output Set" name="OUTSET" offset="0x05" size="1"/>
        <register caption="I/O Port Output Clear" name="OUTCLR" offset="0x06" size="1"/>
        <register caption="I/O Port Output Toggle" name="OUTTGL" offset="0x07" size="1"/>
        <register caption="I/O port Input" name="IN" offset="0x08" size="1"/>
        <register caption="Interrupt Control Register" name="INTCTRL" offset="0x09" size="1">
          <bitfield caption="Port Interrupt 1 Level" mask="0x0C" name="INT1LVL" values="PORT_INT1LVL"/>
          <bitfield caption="Port Interrupt 0 Level" mask="0x03" name="INT0LVL" values="PORT_INT0LVL"/>
        </register>
        <register caption="Port Interrupt 0 Mask" name="INT0MASK" offset="0x0A" size="1"/>
        <register caption="Port Interrupt 1 Mask" name="INT1MASK" offset="0x0B" size="1"/>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
          <bitfield caption="Port Interrupt 1 Flag" mask="0x02" name="INT1IF"/>
          <bitfield caption="Port Interrupt 0 Flag" mask="0x01" name="INT0IF"/>
        </register>
        <register caption="Pin Remap Register (available for PORTC to PORTF only)" name="REMAP" offset="0x0E" size="1">
          <bitfield caption="SPI Remap" mask="0x20" name="SPI"/>
          <bitfield caption="USART0 Remap" mask="0x10" name="USART0"/>
          <bitfield caption="Timer/Counter 0 Output Compare D" mask="0x08" name="TC0D"/>
          <bitfield caption="Timer/Counter 0 Output Compare C" mask="0x04" name="TC0C"/>
          <bitfield caption="Timer/Counter 0 Output Compare B" mask="0x02" name="TC0B"/>
          <bitfield caption="Timer/Counter 0 Output Compare A" mask="0x01" name="TC0A"/>
        </register>
